#Использовать asserts

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ИмяМетода");
	
	
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_ИмяМетода() Экспорт
	
	Данные = "
	|Функция ВернутьТекстВТНачислениеОтпуска() Экспорт
	|
	|	Возврат
	|";

	Навигация = ЗагрузитьСценарий("scripts\Навигация\НавигацияПоМодулю.os");
	ИмяМетода = Навигация.ИмяМетода(Данные);

	Ожидаем.Что(ИмяМетода).Равно("ВернутьТекстВТНачислениеОтпуска");

КонецПроцедуры