#Использовать asserts
#Использовать extensions

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ВернутьТипыСборки");
	
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_ВернутьТипыСборки() Экспорт
	РефлекторСборок = Новый РефлекторСборок();
	РефлекторСборок.ЗагрузитьСборку("c:/work/portable/OneScript/lib/extensions/bin/onescript-extensions.dll");
	
	Типы = РефлекторСборок.ПолучитьТипы();
	
	Для каждого Тип Из Типы Цикл
		Сообщить(Тип.ПолноеИмя);
		Сообщить("	Конструкторы: " + Тип.ПолучитьКонструкторы());
		Для Каждого К из Тип.ПолучитьКонструкторы() Цикл
			Для каждого Прм Из К.Параметры Цикл
				Сообщить("		"+прм.Имя);
			КонецЦикла;
		КонецЦикла;

		Сообщить("	Поля:");
		Для каждого Прм Из Тип.ПолучитьПоля() Цикл
			Сообщить("		"+прм.Имя);
		КонецЦикла;
		
		Сообщить("	Свойства:" + Тип.ПолучитьСвойства());
		Для каждого Прм Из Тип.ПолучитьСвойства() Цикл
			Сообщить("		" + прм.Имя);
		КонецЦикла;


		Сообщить("	Методы: " + Тип.ПолучитьМетоды());
		Для Каждого К из Тип.ПолучитьМетоды() Цикл
			Для каждого Прм Из К.Параметры Цикл
				Сообщить("		"+прм.Имя);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

