#Использовать asserts
#Использовать extensions

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ПроверитьРаботуСБуферомТолькоТекст");
	СписокТестов.Добавить("Тест_Должен_КоличествоЭкранов");
	СписокТестов.Добавить("Тест_Должен_ВернутьРазрешениеЭкрана");
	СписокТестов.Добавить("Тест_Должен_ВернутьКоличествоБит");
	СписокТестов.Добавить("Тест_Должен_ВернутьИмяУстройства");
	
	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ПроверитьРаботуСБуферомТолькоТекст() Экспорт
	Буфер = Новый БуферОбмена();
	Буфер.Установить("есть!");
	Ожидаем.Что(Буфер.Получить()).Равно("есть!");
КонецПроцедуры


Процедура Тест_Должен_КоличествоЭкранов() Экспорт
	ПараметрыЭкрана = Новый ПараметрыЭкрана;
	Ожидаем.Что(ПараметрыЭкрана.КоличествоЭкранов()).Больше(0);
КонецПроцедуры

Процедура Тест_Должен_ВернутьРазрешениеЭкрана() экспорт

	ПараметрыЭкрана = Новый ПараметрыЭкрана;
	Разрешение = ПараметрыЭкрана.ПолучитьРазрешение();
	Сообщить("Разрешение: " + Разрешение.Ширина + "х" + Разрешение.Высота);
	Ожидаем.Что(Разрешение.Высота).Больше(0);
	Ожидаем.Что(Разрешение.Ширина).Больше(0);
	
КонецПроцедуры

Процедура Тест_Должен_ВернутьКоличествоБит() Экспорт
	ПараметрыЭкрана = Новый ПараметрыЭкрана;
	КоличествоБит = ПараметрыЭкрана.КоличествоБит(0);
	Сообщить("КоличествоБит:" + КоличествоБит);
	Ожидаем.Что(КоличествоБит).Больше(0);
КонецПроцедуры

Процедура Тест_Должен_ВернутьИмяУстройства() ЭКспорт
	ПараметрыЭкрана = Новый ПараметрыЭкрана;
	ИмяУстройства = ПараметрыЭкрана.ИмяУстройства(0);
	Сообщить("ИмяУстройства:" + ИмяУстройства);
	Ожидаем.Что(ИмяУстройства).ЭтоНе().Равно("");
КонецПроцедуры