#Использовать asserts
#Использовать gui

Перем Форма;
Перем ТекстПроверки;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_УстановитьСобытиеПриОткрытии");
	СписокТестов.Добавить("Тест_Должен_УстановитьСобытиеПриЗакрытии");

	СписокТестов.Добавить("Тест_Должен_ПоказатьФормуСЗаголовком");

	Возврат СписокТестов;

КонецФункции

Функция ПолучитьФорму()

	Форма = Неопределено;
	
	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	Форма = УправляемыйИнтерфейс.СоздатьФорму();

	Возврат Форма;

КонецФункции


//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	ТекстПроверки = "ПриОткрытииФормы";
	Форма.Закрыть();
КонецПроцедуры

Процедура Тест_Должен_УстановитьСобытиеПриОткрытии() Экспорт

	Форма = ПолучитьФорму();
	ТекстПроверки = "Событие не отработало: ";
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	Форма.Показать();
	
	Ожидаем.Что(ТекстПроверки).Равно("ПриОткрытииФормы");

КонецПроцедуры

Процедура ПриЗакрытииФормы() Экспорт
	ТекстПроверки = "ПриЗакрытииФормы";
КонецПроцедуры

Процедура Тест_Должен_УстановитьСобытиеПриЗакрытии() Экспорт

	ТекстПроверки = "Событие не отработало: ";
	Форма = ПолучитьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	Форма.УстановитьДействие(ЭтотОбъект, "ПриЗакрытии", "ПриЗакрытииФормы");
	Форма.Показать();
	
	Ожидаем.Что(ТекстПроверки).Равно("ПриЗакрытииФормы");

КонецПроцедуры

Процедура Тест_Должен_ПоказатьФормуСЗаголовком() Экспорт

	Форма = ПолучитьФорму();
	Форма.Заголовок = "ЗаголовокСозданнойФормы";
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	Форма.Показать();
	
	ТекущийЗаголовок = Форма.Заголовок;

	Ожидаем.Что(ТекущийЗаголовок).Равно("ЗаголовокСозданнойФормы");

КонецПроцедуры
