#Использовать asserts
#Использовать gui

Перем ТекстПроверки;
Перем УпрИнтерфейс;
Перем Диалоги;

Процедура Инициализация() Экспорт
	УпрИнтерфейс = Новый УправляемыйИнтерфейс();
	Диалоги = УпрИнтерфейс.СтандартныеДиалоги;
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеНет");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеДа");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОК");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОК_ВызовOKCancel");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПовторить_ВызовПовторитьОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеОтмена_ВызовПовторитьОтмена");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПрервать_ВызовПрерватьПовторитьПропустить");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПовторить_ВызовПрерватьПовторитьПропустить");
	СписокТестов.Добавить("Тест_Должен_ВернутьЗначениеПропустить_ВызовПрерватьПовторитьПропустить");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ВернутьЗначениеНет() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ДаНет, 1, КодВозвратаДиалога.Нет , "Заголовок", КодВозвратаДиалога.Нет);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Нет);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеДа() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ДаНет, 1);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Да);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОтмена() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ДаНетОтмена, 1, КодВозвратаДиалога.Отмена , "Заголовок", КодВозвратаДиалога.Отмена);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Отмена);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОК() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ОК, 1, КодВозвратаДиалога.ОК , "Заголовок", КодВозвратаДиалога.ОК);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.ОК);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОК_ВызовOKCancel() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.OKCancel, 1, КодВозвратаДиалога.ОК , "Заголовок", КодВозвратаДиалога.ОК);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.ОК);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПовторить_ВызовПовторитьОтмена() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ПовторитьОтмена, 1);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Повторить);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеОтмена_ВызовПовторитьОтмена() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ПовторитьОтмена, 1, КодВозвратаДиалога.Отмена , "Заголовок", КодВозвратаДиалога.Отмена);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Отмена);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПрервать_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Прервать);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПовторить_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1, КодВозвратаДиалога.Повторить , "Заголовок", КодВозвратаДиалога.Повторить);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Повторить);

КонецПроцедуры

Процедура Тест_Должен_ВернутьЗначениеПропустить_ВызовПрерватьПовторитьПропустить() Экспорт
	
	Ответ = Диалоги.Вопрос("Тест", РежимДиалогаВопрос.ПрерватьПовторитьПропустить, 1, КодВозвратаДиалога.Пропустить , "Заголовок", КодВозвратаДиалога.Пропустить);
	Ожидаем.Что(Ответ).Равно(КодВозвратаДиалога.Пропустить);

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
