#Использовать asserts
#Использовать gui

Перем Форма;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьКнопку");
	СписокТестов.Добавить("Тест_Должен_УстановитьЗаголовок");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмя");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмяИБытьНайден");
	
	СписокТестов.Добавить("Тест_Должен_УстановитьВидимость");
	СписокТестов.Добавить("Тест_Должен_УстановитьДоступность");
	СписокТестов.Добавить("Тест_Должен_ВернутьРодителя");
	СписокТестов.Добавить("Тест_Должен_ОбработатьНажатиеНаКнопку");

	СписокТестов.Добавить("Тест_Должен_ПолучитьДействие");

	Возврат СписокТестов;

КонецФункции

// Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	Форма.Закрыть();
КонецПроцедуры

Процедура ПолучитьФорму()

	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	Форма = УправляемыйИнтерфейс.СоздатьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	ВидыПоляФормы = Форма.ВидГруппыФормы;

КонецПроцедуры

Процедура Тест_Должен_СоздатьКнопку() Экспорт

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Форма.Показать();

	Ожидаем.Что(Форма.Элементы.Количество()).Равно(1);

КонецПроцедуры

Процедура Тест_Должен_УстановитьЗаголовок() Экспорт

	НовыйЗаголовок = "Новый заголовок кнопки";

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Заголовок = НовыйЗаголовок;
	Форма.Показать();

	Ожидаем.Что(Кнопка.Заголовок).Равно(НовыйЗаголовок);

КонецПроцедуры

Процедура Тест_Должен_УстановитьИмя() Экспорт

	НовоеИмя = "НовоеИмя";

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Имя = НовоеИмя;
	Форма.Показать();
	Ожидаем.Что(Кнопка.Имя).Равно(НовоеИмя);
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьИмяИБытьНайден() Экспорт

	НовоеИмя = "НовоеИмя";

	ПолучитьФорму();
	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Имя = НовоеИмя;
	Форма.Показать();

	Ожидаем.Что(Форма.Элементы.Найти(НовоеИмя)).Существует();
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьВидимость() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Видимость = Истина;

	Ожидаем.Что(Кнопка.Visible).Равно(Истина);

	Кнопка.Видимость = Ложь;
	Ожидаем.Что(Кнопка.Visible).Равно(Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьДоступность() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка.Доступность = Истина;

	Ожидаем.Что(Кнопка.Enabled).Равно(Истина);

	Кнопка.Доступность = Ложь;
	Ожидаем.Что(Кнопка.Enabled).Равно(Ложь);
	
КонецПроцедуры



Процедура Тест_Должен_ВернутьРодителя() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Кнопка = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);

	Ожидаем.Что(Строка(Кнопка.Родитель)).Равно("УправляемаяФорма");

	Группа = Форма.Элементы.Добавить("Группа", "ГруппаФормы", Неопределено);

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "ПолеФормы", Группа);
	Ожидаем.Что(Строка(Кнопка2.Родитель)).Равно("ГруппаФормы");

	Группа1 = Форма.Элементы.Добавить("Группа1", "ГруппаФормы", Неопределено);
	Группа1.Вид = Форма.ВидГруппыФормы.ОбычнаяГруппа;

	Форма.Элементы.Переместить(Кнопка2, Группа1, Неопределено);

	Ожидаем.Что(Строка(Кнопка2.Родитель.Имя)).Равно("Группа1");

	
КонецПроцедуры

Процедура ПриНажатииНаКнопку() Экспорт
	Сообщить("КнопкаНажатие: Нажали на кнопку");
КонецПроцедуры

Процедура ПриНажатииНаКнопку2() Экспорт
	Сообщить("УстановитьДействие: Нажали на кнопку");
КонецПроцедуры


Процедура Тест_Должен_ОбработатьНажатиеНаКнопку() Экспорт
	ПолучитьФорму();
	
	Кнопка1 = Форма.Элементы.Добавить("Кнопка1", "КнопкаФормы", Неопределено);
	Кнопка1.КнопкаНажатие(ЭтотОбъект,"ПриНажатииНаКнопку");

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "КнопкаФормы", Неопределено);
	Кнопка2.УстановитьДействие(ЭтотОбъект, "Нажатие", "ПриНажатииНаКнопку2");

	Форма.Показать();

КонецПроцедуры

Процедура Тест_Должен_ПолучитьДействие() Экспорт
	ПолучитьФорму();

	Кнопка2 = Форма.Элементы.Добавить("Кнопка2", "КнопкаФормы", Неопределено);
	Кнопка2.УстановитьДействие(ТекущийСценарий(), "Нажатие", "ПриНажатииНаКнопку2");

	Ожидаем.Что(Кнопка2.ПолучитьДействие("Нажатие")).ЭтоНе().Равно("");

	Форма.Показать();
	
КонецПроцедуры
