#Использовать asserts
#Использовать gui

Перем ВидыПоляФормы;
Перем ТекстПриИзменении;
Перем Форма;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СоздатьТекстовоеПоле");
	СписокТестов.Добавить("Тест_Должен_ПровестиРаботуСоЗначением");
	СписокТестов.Добавить("Тест_Должен_УстановитьЗаголовок");
	СписокТестов.Добавить("Тест_Должен_УстановитьИмя");
	СписокТестов.Добавить("Тест_Должен_УстановитьВидимость");
	СписокТестов.Добавить("Тест_Должен_УстановитьДоступность");
	СписокТестов.Добавить("Тест_Должен_ВернутьРодителя");
	СписокТестов.Добавить("Тест_Должен_УстановитьТолькоПросмотр");
	СписокТестов.Добавить("Тест_Должен_ПроверитьПоложениеЗаголовка");
	
	СписокТестов.Добавить("Тест_Должен_УстановитьИПроверитьДействиеПриИзмении");
	СписокТестов.Добавить("Тест_Должен_ПолучитьДействие");
	
	Возврат СписокТестов;

КонецФункции

//# Работа с событиями
Процедура ПриОткрытииФормы() Экспорт
	Форма.Закрыть();
КонецПроцедуры

Процедура ПолучитьФорму()

	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	Форма = УправляемыйИнтерфейс.СоздатьФорму();
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	ВидыПоляФормы = Форма.ВидГруппыФормы;

КонецПроцедуры

Процедура Тест_Должен_СоздатьТекстовоеПоле() Экспорт

	ПолучитьФорму();
	Форма.Показать();	

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;

	Ожидаем.Что(Форма.Элементы.Найти("Поле1")).Существует();

КонецПроцедуры

Процедура Тест_Должен_ПровестиРаботуСоЗначением() Экспорт

	ПолучитьФорму();
	Форма.Показать();	

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	Поле1.Значение = "ПроверкаЗначения";

	Ожидаем.Что(Форма.Элементы.Найти("Поле1").Значение).Равно("ПроверкаЗначения");

КонецПроцедуры

Процедура Тест_Должен_УстановитьЗаголовок() Экспорт

	НовыйЗаголовок = "Новый заголовок";

	ПолучитьФорму();
	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	Поле1.Заголовок = НовыйЗаголовок;
	Форма.Показать();

	Ожидаем.Что(Форма.Элементы.Найти("Поле1").Заголовок).Равно(НовыйЗаголовок);

КонецПроцедуры

Процедура Тест_Должен_УстановитьИмя() Экспорт

	НовоеИмя = "НовоеИмя";

	ПолучитьФорму();
	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	Поле1.Имя = НовоеИмя;
	Форма.Показать();

	Ожидаем.Что(Форма.Элементы.Найти(НовоеИмя).Имя).Равно(НовоеИмя);

КонецПроцедуры

Процедура Тест_Должен_УстановитьВидимость() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	Поле1.Видимость = Истина;
	Ожидаем.Что(Поле1.Visible).Равно(Истина);

	Поле1.Видимость = Ложь;
	Ожидаем.Что(Поле1.Visible).Равно(Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьДоступность() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	
	Поле1.Доступность = Истина;
	Ожидаем.Что(Поле1.Enabled).Равно(Истина);

	Поле1.Доступность = Ложь;
	Ожидаем.Что(Поле1.Enabled).Равно(Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_ВернутьРодителя() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;

	Ожидаем.Что(Строка(Форма.Элементы.Найти("Поле1").Родитель)).Равно("УправляемаяФорма");

	Группа = Форма.Элементы.Добавить("Группа", "ГруппаФормы", Неопределено);

	Поле2 = Форма.Элементы.Добавить("Поле2", "ПолеФормы", Группа);
	Ожидаем.Что(Группа.Элементы.Найти("Поле2").Родитель).Равно(Группа);

	//# Не должно быть у формы
	//юТест.ПроверитьРавенство(Форма.Элементы.Найти("Поле2"), Неопределено);
	Ожидаем.Что(Форма.Элементы.Найти("Поле2")).Равно(Неопределено);
	
КонецПроцедуры

Процедура Тест_Должен_УстановитьТолькоПросмотр() Экспорт

	ПолучитьФорму();
	Форма.Показать();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	
	Поле1.ТолькоПросмотр = Истина;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ReadOnly).Равно(Истина);

	Поле1.ТолькоПросмотр = Ложь;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ReadOnly).Равно(Ложь);
	
КонецПроцедуры

Процедура Тест_Должен_ПроверитьПоложениеЗаголовка() Экспорт
	
	ПолучитьФорму();
	Форма.Показать();

	ПоложенияЗаголовка = Форма.ПоложениеЗаголовка;

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Авто;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка).Равно(ПоложенияЗаголовка.Авто);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Верх;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка).Равно(ПоложенияЗаголовка.Верх);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Лево;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка).Равно(ПоложенияЗаголовка.Лево);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Нет;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка).Равно(ПоложенияЗаголовка.Нет);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Низ;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка).Равно(ПоложенияЗаголовка.Низ);

	Поле1.ПоложениеЗаголовка = ПоложенияЗаголовка.Право;
	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ПоложениеЗаголовка).Равно(ПоложенияЗаголовка.Право);


КонецПроцедуры


//# Работа с событиями
Процедура ПриИзменииЗначения() Экспорт
	ТекстПриИзменении = "Новое значение: ";
КонецПроцедуры

Процедура Тест_Должен_УстановитьИПроверитьДействиеПриИзмении() Экспорт
	ПолучитьФорму();
	
	ТекстПриИзменении = "Исходный текст: ";

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	Поле1.УстановитьДействие(ЭтотОбъект, "ПриИзменении", "ПриИзменииЗначения");
	Поле1.Значение = "Произвольный текст";

	Ожидаем.Что(ТекстПриИзменении + Форма.Элементы.Найти("Поле1").Значение).Равно("Новое значение: Произвольный текст");

	Форма.Показать();

КонецПроцедуры

Процедура Тест_Должен_ПолучитьДействие() Экспорт
	ПолучитьФорму();

	Поле1 = Форма.Элементы.Добавить("Поле1", "ПолеФормы", Неопределено);
	Поле1.Вид = Форма.ВидПоляФормы.ПолеВвода;
	Поле1.УстановитьДействие(ЭтотОбъект, "ПриИзменении", "ПриИзменииЗначения");

	Ожидаем.Что(Форма.Элементы.Найти("Поле1").ПолучитьДействие("ПриИзменении")).ЭтоНе().Равно("");

	Форма.Показать();

КонецПроцедуры
